app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    render :json => Project.all.as_json(Project.default_json_options)

INSERT INTO "projects" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-06-23 08:55:03.605693"], ["title", "Test title"], ["updated_at", "2014-06-23 08:55:03.605693"], ["url", "Click to edit"]]
---
  def create
    @project = Project.create!(allowed_params)

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "projects" SET "title" = $1, "updated_at" = $2 WHERE "projects"."id" = 4  [["title", "Hello"], ["updated_at", "2014-06-25 17:17:06.040733"]]
---
  def update
    @project = Project.find(params[:id])
    @project.update_attributes(allowed_params)