app/controllers/projects_controller.rb

  def index
    render :json => Project.all.as_json(:include => {
    :skills => {:only => [:id, :name, :project_id]}
    }, :except => [:created_at, :updated_at])
---
SELECT "skills".* FROM "skills"  WHERE "skills"."project_id" = $1  [["project_id", 1]]