app/controllers/users_controller.rb

INSERT INTO "users" ("bio", "created_at", "image_url", "mission", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bio", "Edit me"], ["created_at", "2014-06-25 14:11:39.338675"], ["image_url", "uploads/me.jpg"], ["mission", "Edit me"], ["name", "Edit me"], ["updated_at", "2014-06-25 14:11:39.338675"]]
---
  def create
    @user = User.create(allowed_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "mission" = $1, "updated_at" = $2 WHERE "users"."id" = 5  [["mission", "A mission statement"], ["updated_at", "2014-06-25 16:05:31.818512"]]
---
  def update
    @user = User.find(params[:id])
    @user.update(allowed_params)

INSERT INTO "users" ("created_at", "github_id", "image_url", "mission", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users"  WHERE "users"."github_id" = 6864509 AND "users"."name" = 'Daniel Sun' AND "users"."bio" IS NULL AND "users"."mission" = 'We Got Coders' AND "users"."image_url" = 'https://avatars.githubusercontent.com/u/6864509?' LIMIT 1
UPDATE "users" SET "access_token" = $1, "updated_at" = $2 WHERE "users"."id" = 4  [["access_token", "5229394484b545d35a34e99a4c86862c8a1b4ede"], ["updated_at", "2014-06-25 14:11:44.351148"]]
---
  def github_oauth_callback
    access_token = github_oauth_client.auth_code.get_token(params[:code],
        :redirect_uri => github_oauth_callback_url)

    user_info = JSON(access_token.get('https://api.github.com/user').body).symbolize_keys

    github_id = user_info[:id]
    @user = User.find_or_create_by!(:github_id => github_id,
                                   :name => user_info[:name],
                                   :bio => user_info[:bio],
                                   :mission => user_info[:company],
                                   :image_url => user_info[:avatar_url]
                                   )
    @user.access_token = access_token.token
    @user.save!